eir_pilot_template.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cai3="http://schemas.ericsson.com/cai3g1.2/" xmlns:ns="http://schemas.ericsson.com/ema/UserProvisioning/IMS/5.0/">
   <soapenv:Header>
      <cai3:SessionId>$SESSION_ID</cai3:SessionId>
   </soapenv:Header>
   <soapenv:Body>
      <cai3:Create>
         <cai3:MOType>IMSSubscription@http://schemas.ericsson.com/ema/UserProvisioning/IMS/5.0/</cai3:MOType>
         <cai3:MOId>
            <ns:subscriberId>$SUB_ID_LINEPORT</ns:subscriberId>
         </cai3:MOId>
         <cai3:MOAttributes>
            <ns:createIMSSubscription subscriberId="$SUB_ID_LINEPORT">
               <ns:subscriberId>$SUB_ID_LINEPORT</ns:subscriberId>
               <ns:subscriberBarringInd>FALSE</ns:subscriberBarringInd>
               <ns:pubData publicIdValue="sip:$SUB_ID_LINEPORT">
                  <ns:publicIdValue>sip:$SUB_ID_LINEPORT</ns:publicIdValue>
                  <ns:privateUserId>$SUB_ID_LINEPORT</ns:privateUserId>
                  <ns:xcapAllowed>FALSE</ns:xcapAllowed>
                  <ns:implicitRegSet>1</ns:implicitRegSet>
                  <ns:isDefault>TRUE</ns:isDefault>
                  <ns:configuredServiceProfiles configuredServiceProfileId="$PROFILE_ID">
                     <ns:configuredServiceProfileId>$PROFILE_ID</ns:configuredServiceProfileId>
                  </ns:configuredServiceProfiles>
               </ns:pubData>
               <ns:privateUser privateUserId="$SUB_ID_LINEPORT">
                  <ns:privateUserId>$SUB_ID_LINEPORT</ns:privateUserId>
                  <ns:userPassword>$PASSWORD</ns:userPassword>
                  <ns:roamingAllowed>FALSE</ns:roamingAllowed>
                  <ns:allowedAuthMechanism>Digest</ns:allowedAuthMechanism>
               </ns:privateUser>
            </ns:createIMSSubscription>
         </cai3:MOAttributes>
      </cai3:Create>
   </soapenv:Body>
</soapenv:Envelope>