EPS/EPS_Set.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cai3="http://schemas.ericsson.com/cai3g1.2/" xmlns:hss="http://schemas.ericsson.com/ma/HSS/">
   <soapenv:Header>
      <cai3:SessionId></cai3:SessionId>
   </soapenv:Header>
   <soapenv:Body>
      <cai3:Set>
         <cai3:MOType>EPSMultiSC@http://schemas.ericsson.com/ma/HSS/</cai3:MOType>
         <cai3:MOId>
            <hss:imsi>290013110342702</hss:imsi>
         </cai3:MOId>
         <cai3:MOAttributes>
            <hss:SetEPSMultiSC imsi="290013110342702">
               <hss:epsSessionTransferNumber>299500090</hss:epsSessionTransferNumber>
            </hss:SetEPSMultiSC>
         </cai3:MOAttributes>
      </cai3:Set>
   </soapenv:Body>
</soapenv:Envelope>
